# What is classification

Classification is a supervised learning concept which basically categorizes a set of data into classes.
The most common classification problems are â€“ speech recognition, face detection, handwriting recognition, document classification, etc. It can be either a binary classification problem or a multi-class problem too.

# Classification Algorithms

* Logistic Regression
* Naive Bayes
* Stochastic Gradient Descent
* K-Nearest Neighbors
* Decision Tree
* Random Forest
* Artificial Neural Network
* Support Vector Machine
* XGBoost
* Light GBM
* CatBoost

### Applications of Classification Algorithms

* Email spam classification
* Bank customers loan pay willingness prediction.
* Cancer tumor cell identification.
* Sentiment analysis
* Drugs classification
* Facial keypoints detection
* Pedestrian detection in automotive car driving.

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# EDA

In [8]:
#personal informations applications

df = pd.read_csv("data/application_record.csv")
df.columns =map(str.lower, df.columns)
df.head()

,id,code_gender,flag_own_car,flag_own_realty,cnt_children,amt_income_total,name_income_type,name_education_type,name_family_status,name_housing_type,days_birth,days_employed,flag_mobil,flag_work_phone,flag_phone,flag_email,occupation_type,cnt_fam_members
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   id                   438557 non-null  int64
 1   code_gender          438557 non-null  object
 2   flag_own_car         438557 non-null  object
 3   flag_own_realty      438557 non-null  object
 4   cnt_children         438557 non-null  int64
 5   amt_income_total     438557 non-null  float64
 6   name_income_type     438557 non-null  object
 7   name_education_type  438557 non-null  object
 8   name_family_status   438557 non-null  object
 9   name_housing_type    438557 non-null  object
 10  days_birth           438557 non-null  int64
 11  days_employed        438557 non-null  int64
 12  flag_mobil           438557 non-null  int64
 13  flag_work_phone      438557 non-null  int64
 14  flag_phone           438557 non-null  int64
 15  flag_email           438557 non-null  int64
 16  occupation_type      304354 non-null  object
 17  cnt_fam_members      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

In [10]:
#transactional Info
credit = pd.read_csv("data/credit_record.csv")
credit.columns = map(str.lower, credit.columns)
credit.head()

        id  months_balance status
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [11]:
credit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   id              1048575 non-null  int64
 1   months_balance  1048575 non-null  int64
 2   status          1048575 non-null  object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

In [12]:
# Convert Status column to numeric
credit.status = credit.status.replace({'X':-2, 'C':-1})
credit.status = credit.status.astype('int')
credit.status = credit.status.apply(lambda x:x+1)